Track_time = 100 #длина траектории

G = 4.434  # Гравитационная постоянная

#Сила магнитного взаимодействия(одинаковые цвета -
#притягиваются, разные - отталкиваются)
MagnConst = 0

zg = 2 # Закон для гравитационного взаимодействия
zm = 2 #Закон для магнитного взаимодействия
k = 40 # Коэффициент трения, чем больше - тем меньше трение
antiG = 0.1 # Отталкивание частиц
max_speed = 3 # Максимальная скорость
ResDist = 1 # Расстояние отталкивания

Mirror = True # Отражение частиц от стенок
Walls = False # Флаг столкновения с стенками

# Константы для экрана
FPS = 61
darkblue = (0, 2, 25)
ORANGE = (255, 200, 150)
RED = (255, 150, 150)
GREEN = (150, 255, 150)
BLUE = (150, 150, 255)
YELLOW = (255, 255, 0)
GREY = (198,195,181)
WHITE = (255, 255, 255)

# Списки
B = []
T =[]